[
  {
    "name": "Elf",
    "source": "PHB",
    "senses": {
      "darkvision": 60
    },
    "skills": [
      "Perception"
    ],
    "features": [
      {
        "name": "Fey Ancestry",
        "dm_discretion": "Wild shape forms retain racial features if they are physically capable. Biological features may or may not count.",
        "description": "You have advantage on saving throws against being charmed, and magic can’t put you to sleep."
      },
      {
        "name": "Trance",
        "dm_discretion": "Wild shape forms retain racial features if they are physically capable. Biological features may or may not count.",
        "description": "Elves don’t need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is “trance.”) While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."
      }
    ],
    "subraces": [
      {
        "name": "High Elf",
        "source": "PHB"
      },
      {
        "name": "Wood Elf",
        "source": "PHB",
        "features": [
          {
            "name": "Mask of the Wild",
            "description": "You can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena."
          }
        ]
      },
      {
        "name": "Drow",
        "source": "PHB",
        "senses": {
          "darkvision": 120
        },
        "features": [
          {
            "name": "Sunlight Sensitivity",
            "dm_discretion": "Wild shape forms retain racial features if they are physically capable. Biological features may or may not count.",
            "description": "You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight."
          },
          {
            "name": "Drow Magic",
            "requires_casting": true,
            "description": "You know the dancing lights cantrip. When you reach 3rd level, you can cast the faerie fire spell once per day. When you reach 5th level, you can also cast the darkness spell once per day. Charisma is your spellcasting ability for these spells."
          }
        ]
      },
      {
        "name": "Eladrin (DMG)",
        "source": "DMG",
        "features": [
          {
            "name": "Fey Step",
            "requires_casting": true,
            "description": "You can cast the misty step spell once usin this trait. You regain the ability to do so when you finish a short or long rest."
          }
        ]
      },
      {
        "name": "Eladrin (UA)",
        "source": "Unearthed Arcana: Eladrin and Gith",
        "features": [
          {
            "name": "Fey Step",
            "requires_casting": false,
            "dm_discretion": "Wild shape prevents casting. This feature doesn't require casting, but is described as magical.",
            "description": "As a bonus action, you can magically teleport up to 30 feet to an unoccupied space you can see. Once you use this trait, you can’t do so again until you finish a short or long rest."
          }
        ]
      }
    ]
  }
]